Revit 2027 API
BuiltInFailures.RebarFailures.RebarShapeFailureCustomWarning Property
 '[ErrorMessage]'
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarShapeFailureCustomWarning { get; }
Public Shared ReadOnly Property RebarShapeFailureCustomWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarShapeFailureCustomWarning {
	FailureDefinitionId^ get ();
}
static member RebarShapeFailureCustomWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace